{
  "backend/main.mo": "Main Motoko actor implementing storage, authorization mixins, user profiles, trades, mistakes, subscriptions, payments, and QR code upload/clear APIs.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to frontend files, components, and related test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing structure, behavior, and styling changes.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark mode color tokens and global styles.",
  "frontend/index.html": "Root HTML file setting metadata, fonts, theme initialization, env loader, and mounting point for the React app.",
  "frontend/public/domain-slug.txt": "Contains the deployment domain slug string.",
  "frontend/public/env.json": "Holds the backend canister ID placeholder for runtime configuration.",
  "frontend/src/App.tsx": "Main React app shell handling authentication, entitlement-based tab visibility, profile setup flow, and tab rendering.",
  "frontend/src/components/admin/AdminAccessDialog.tsx": "A dialog for entering and validating the admin password, handling success, errors, and cancellation.",
  "frontend/src/components/admin/AdminDiscountsDialog.tsx": "Manages discount codes including creation, editing, toggling enabled state, and deletion with form controls and list display.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin dashboard providing navigation to user management, payments, discounts, payment methods, QR code management, and password rotation dialogs.",
  "frontend/src/components/admin/AdminPaymentMethodsDialog.tsx": "Allows creating, editing, enabling/disabling, and deleting payment methods, with form handling and state management.",
  "frontend/src/components/admin/AdminPaymentQRCodeDialog.tsx": "Handles uploading, previewing, clearing, and validating a payment QR code with progress tracking and error handling.",
  "frontend/src/components/admin/AdminPaymentsDialog.tsx": "Displays pending user payments and supports approving, rejecting, and viewing payment proof files.",
  "frontend/src/components/admin/AdminRotatePasswordDialog.tsx": "Dialog for permanent admins to set or update the admin password with validation, permission checks, and success/error handling.",
  "frontend/src/components/admin/AdminUserDetailDialog.tsx": "Displays detailed user info and lets admins manage subscriptions or remove the user, with confirmation dialogs for each action.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity, handling authentication state, retries, and query cache clearing.",
  "frontend/src/components/journal/EditTradeDialog.tsx": "Form dialog for editing or deleting an existing trade entry, including date, session, pair, metrics, and outcome fields.",
  "frontend/src/components/journal/JournalAnalyticsHeader.tsx": "Shows summary analytics such as total trades, accuracy, and total P/L with loading skeletons when data is missing.",
  "frontend/src/components/journal/ProfitCalendar.tsx": "Monthly calendar displaying daily net P/L and trade counts, allowing month navigation and day selection.",
  "frontend/src/components/journal/TradeEntryForm.tsx": "Trade entry form that collects trade details, validates readiness, and submits data to create a new trade.",
  "frontend/src/components/journal/TradeList.tsx": "Displays a table of trades with P/L calculations, edit options, and loading or empty states.",
  "frontend/src/components/layout/ViewContainer.tsx": "Simple layout wrapper that applies background and text styling around child content.",
  "frontend/src/components/mistakes/EditMistakeDialog.tsx": "Dialog for editing or deleting a mistake entry with confirmation handling.",
  "frontend/src/components/mistakes/MistakeEntryForm.tsx": "Form for creating a new mistake log entry with date, category, and description submission.",
  "frontend/src/components/mistakes/MistakeList.tsx": "Lists logged mistakes with category, date, AI suggestion, and editing support, including loading and empty states.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar rendering tabs with icons and active-state styling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Renders a dialog for entering full name and username to create a user profile and start a free trial.",
  "frontend/src/components/subscriptions/PaymentView.tsx": "Handles subscription payment submission including uploading PDF proof, entering transaction details, and showing confirmation.",
  "frontend/src/components/subscriptions/SubscriptionsView.tsx": "Displays current subscription or trial status and lets users select a plan or proceed to payment.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Provides actor creation with connection status, retries, timeouts, and error handling for backend initialization.",
  "frontend/src/hooks/useEntitlement.ts": "Determines user feature access based on trial, expired, or paid subscription state and returns entitlement flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient initialization and exposes status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions such as user initialization, trades, and mistakes, including create, update, delete, and error handling. Uses actor-based calls with cache invalidation and toast notifications.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and applies theme classes to the document root. Exposes theme value and setter.",
  "frontend/src/index.css": "Tailwind CSS base and theme variables for light/dark modes, plus layout, text, dialog, and z-index utility styles. Defines the app’s primary color system and global styling.",
  "frontend/src/lib/backendConnectionErrors.ts": "Classifies backend errors into authorization, canister-stopped, or generic categories and returns structured details for UI messaging. Includes helper detection functions.",
  "frontend/src/lib/backendDiagnostics.ts": "Collects environment diagnostics such as canister ID, deployment type, and host origin, and flags possible misconfiguration. Provides formatting for diagnostic output.",
  "frontend/src/lib/branding.ts": "Exports constants for the app's name, tagline, and logo path. Centralizes branding values.",
  "frontend/src/lib/domainSlug.ts": "Validates and generates domain slugs based on character and length rules. Includes a predefined slug for the app.",
  "frontend/src/lib/pipValues.ts": "Defines pip values for common trading pairs and provides a lookup function that handles special cases. Used for trading calculations.",
  "frontend/src/lib/riskCalculator.ts": "Implements pip value lookup and a lot-size calculator with input validation. Returns calculation results with error states.",
  "frontend/src/lib/safeErrorMessage.ts": "Normalizes backend and application errors into human‑friendly messages, covering payments, authorization, subscriptions, profiles, trades, and network issues. Provides a broad fallback for unknown errors.",
  "frontend/src/lib/trades.ts": "Contains utilities for calculating profit/loss values and formatting currency and signed P/L strings for trade entries.",
  "frontend/src/lib/tradingPairs.ts": "Exports predefined trading pair options and an extended list for calculators, mapping pair codes to display labels.",
  "frontend/src/lib/userId.ts": "Formats numeric user IDs as padded strings and parses them back to numbers.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider.",
  "frontend/src/tabs/AdminPanelTab.tsx": "Handles admin authorization logic and displays admin panel or access dialog.",
  "frontend/src/tabs/JournalTab.tsx": "Displays trade journal with analytics, entry form, list, and calendar filter.",
  "frontend/src/tabs/MistakesTab.tsx": "Shows mistake logging UI with AI suggestions and a list of logged mistakes.",
  "frontend/src/tabs/ProfileTab.tsx": "Displays user profile and subscription info with theme controls and error states.",
  "frontend/src/tabs/RiskCalculatorTab.tsx": "Implements a risk calculator for position sizing with validation and warnings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and content paths.",
  "project_state.json": "Defines project metadata and a list of feature requirements for enhancing a trading risk calculator across funded and personal account workflows. Includes schema versioning and existing feature entries outlining UI updates, inputs, and validation behaviors."
}