{
  "backend/main.mo": "Motoko backend actor defining user profiles, trades, mistakes, subscriptions, payments, admin access, and QR code storage with authorization mixins and multiple data maps.",
  "feature_evidence.json": "Feature evidence report listing rollback and restore-related features with impacted files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief descriptions of their UI, logic, and feature behavior for build planning.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark mode styling throughout the app.",
  "frontend/index.html": "HTML entry point loading fonts, theme initialization, runtime env config, and mounting the React app.",
  "frontend/public/domain-slug.txt": "Plain text file defining the app’s domain slug.",
  "frontend/public/env.json": "Environment config placeholder containing the backend canister ID value.",
  "frontend/src/App.tsx": "Main React app component handling authentication, entitlement-based tab navigation, profile setup, and page layout.",
  "frontend/src/components/admin/AdminAccessDialog.tsx": "Admin password dialog allowing protected access to admin features with validation and mutation handling.",
  "frontend/src/components/admin/AdminDiscountsDialog.tsx": "Dialog component for listing, creating, editing, enabling/disabling, and deleting discount codes with form state management.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin dashboard providing navigation to user management and various admin dialogs for payments, methods, discounts, QR codes, and password rotation.",
  "frontend/src/components/admin/AdminPaymentMethodsDialog.tsx": "Dialog for viewing, adding, editing, enabling/disabling, and deleting payment methods using CRUD hooks.",
  "frontend/src/components/admin/AdminPaymentQRCodeDialog.tsx": "Dialog that displays, uploads, previews, validates, and clears the global payment QR code with progress tracking and error handling.",
  "frontend/src/components/admin/AdminPaymentsDialog.tsx": "Dialog for reviewing pending payments, viewing proof files, and approving or rejecting payment submissions.",
  "frontend/src/components/admin/AdminRotatePasswordDialog.tsx": "Dialog component for permanent admins to validate, rotate, and save a new admin password with permission checks and success/error handling.",
  "frontend/src/components/admin/AdminUserDetailDialog.tsx": "Admin dialog showing user profile, trades, subscription status, and provides actions to activate, cancel, or remove a user.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error recovery for existing sessions.",
  "frontend/src/components/journal/EditTradeDialog.tsx": "Dialog for editing or deleting a trade entry, updating fields and confirming deletions through API mutations.",
  "frontend/src/components/journal/JournalAnalyticsHeader.tsx": "Header component displaying total trades, accuracy, and total P/L with loading skeletons when analytics are unavailable.",
  "frontend/src/components/journal/ProfitCalendar.tsx": "Monthly calendar summarizing daily P/L and trade counts, allowing date selection and month navigation.",
  "frontend/src/components/journal/TradeEntryForm.tsx": "Form component for creating new trade entries, handling input fields, submission, and backend mutation state. Includes UI for date, session, pair, risk metrics, and outcome selection.",
  "frontend/src/components/journal/TradeList.tsx": "Displays a table of recorded trades with formatted dates, P/L calculations, and optional editing actions. Shows loading skeletons and empty-state messaging.",
  "frontend/src/components/layout/ViewContainer.tsx": "Simple wrapper component providing layout structure with background and text styling. Renders child content inside a styled container.",
  "frontend/src/components/mistakes/EditMistakeDialog.tsx": "Dialog for editing or deleting a mistake entry, including form handling and backend update/delete mutations. Supports delete confirmation through an alert dialog.",
  "frontend/src/components/mistakes/MistakeEntryForm.tsx": "Form for logging new trading mistakes with date, category, and description. Submits data via createMistake mutation and resets fields on success.",
  "frontend/src/components/mistakes/MistakeList.tsx": "Renders a list of mistake entries with category badges, dates, descriptions, and AI suggestions. Supports editing entries and shows loading or empty states.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar rendering interactive tabs with icons and labels. Highlights the active tab and triggers tab changes via callback.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A dialog that collects full name and username to create a user profile and start a 2‑day free trial.",
  "frontend/src/components/subscriptions/PaymentView.tsx": "Handles subscription payment submission, including uploading a PDF proof, entering transaction details, and showing a success state.",
  "frontend/src/components/subscriptions/SubscriptionsView.tsx": "Displays trial and subscription status, available plans, and routes users to payment flow when a plan is selected.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useActorWithStatus.ts": "Manages backend actor initialization with connection status, retries, timeouts, and access control setup.",
  "frontend/src/hooks/useEntitlement.ts": "Derives the user's feature entitlements from their subscription or trial state and exposes loading-aware access flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for initializing user access and performing CRUD operations on trades and mistakes via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages a light/dark theme with localStorage persistence and applies theme classes to the document root.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables, dark mode rules, layout helpers, and utility overrides.",
  "frontend/src/lib/backendConnectionErrors.ts": "Classifies backend errors into user-friendly categories like authorization, stopped canister, or generic connection issues.",
  "frontend/src/lib/backendDiagnostics.ts": "Collects runtime diagnostics about canister ID, environment, and deployment type, with helpers to format the output.",
  "frontend/src/lib/branding.ts": "Exports static branding metadata including app name, tagline, and logo path.",
  "frontend/src/lib/domainSlug.ts": "Validates and generates URL-safe domain slugs and defines the app’s preset slug.",
  "frontend/src/lib/pipValues.ts": "Provides pip values for currency pairs and a helper to retrieve a pair’s pip value or null.",
  "frontend/src/lib/riskCalculator.ts": "Implements pip value lookup and a lot-size calculator with input validation.",
  "frontend/src/lib/safeErrorMessage.ts": "Normalizes backend and payment errors into readable, user-friendly messages.",
  "frontend/src/lib/trades.ts": "Utility functions to compute trade P/L and format currency or signed values.",
  "frontend/src/lib/tradingPairs.ts": "Exports selectable trading pair lists for general use and calculators, including common FX and metal pairs.",
  "frontend/src/lib/userId.ts": "Formats numeric user IDs to a padded #000000 style and parses them back to numbers with validation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/tabs/AdminPanelTab.tsx": "Handles admin access checks and displays the admin panel or an access dialog based on authorization.",
  "frontend/src/tabs/JournalTab.tsx": "Loads trades and analytics, provides trade entry, and displays trades in list or calendar views.",
  "frontend/src/tabs/MistakesTab.tsx": "Fetches and displays trading mistakes with an entry form and AI suggestion notice.",
  "frontend/src/tabs/ProfileTab.tsx": "Shows user profile and subscription details with conditional loading, errors, and subscription view switching.",
  "frontend/src/tabs/RiskCalculatorTab.tsx": "Provides a risk calculator for position sizing based on account settings, risk mode, pip values, and trade inputs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, animations, and enabled plugins.",
  "project_state.json": "Tracks project state for restoring an app to Version 35, detailing failed rollback attempts and existing restore-related features. Indicates the project is a fix request with no new features."
}