{
  "backend/main.mo": "Backend canister defining user profiles, trades, mistakes, subscriptions, payments, admin auth, and QR code upload/view logic with authorization mixins and multiple data maps.",
  "feature_evidence.json": "Lists feature evidence entries linking features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides 1–2 sentence summaries for numerous frontend files including tabs, components, hooks, utilities, and styling.",
  "frontend/index.css": "Defines global OKLCH-based light/dark theme variables and Tailwind base styles for consistent theming.",
  "frontend/index.html": "HTML entry point with early theme initialization using localStorage and mounting the React app.",
  "frontend/public/domain-slug.txt": "Contains the domain slug string for the frontend deployment.",
  "frontend/src/App.tsx": "Main React app managing authentication, entitlement-based tab visibility, backend connection states, and overall UI layout.",
  "frontend/src/components/admin/AdminAccessDialog.tsx": "Modal dialog for entering the admin password to unlock admin access with validation and error handling.",
  "frontend/src/components/admin/AdminDiscountsDialog.tsx": "Dialog component for listing, creating, editing, enabling/disabling, and deleting discount codes using admin query hooks.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin dashboard providing navigation to user management and dialogs for payments, payment methods, discounts, QR codes, and password rotation.",
  "frontend/src/components/admin/AdminPaymentMethodsDialog.tsx": "Dialog for admins to create, edit, enable/disable, and delete payment methods with form handling and query hooks.",
  "frontend/src/components/admin/AdminPaymentQRCodeDialog.tsx": "Dialog for uploading, previewing, replacing, and deleting the payment QR code with file validation and upload progress tracking.",
  "frontend/src/components/admin/AdminPaymentsDialog.tsx": "Dialog showing pending payments where admins can view proofs, approve or reject payments, and activate subscriptions.",
  "frontend/src/components/admin/AdminRotatePasswordDialog.tsx": "Dialog for permanent admins to validate and update the admin unlock password with success and error handling.",
  "frontend/src/components/admin/AdminUserDetailDialog.tsx": "Admin panel dialog showing user details, subscription status, and actions to activate, cancel, or remove a user.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic session handling and UI state indicators.",
  "frontend/src/components/journal/EditTradeDialog.tsx": "Dialog for editing or deleting a trade entry with form inputs and confirmation for deletion.",
  "frontend/src/components/journal/JournalAnalyticsHeader.tsx": "Displays summary analytics such as total trades, accuracy, and total P/L with loading skeletons.",
  "frontend/src/components/journal/ProfitCalendar.tsx": "Renders a monthly calendar showing daily net P/L and trade counts with navigation and date selection.",
  "frontend/src/components/journal/TradeEntryForm.tsx": "Form component for creating a new trade entry, handling input state, validation, and submission via createTrade.",
  "frontend/src/components/journal/TradeList.tsx": "Displays a list of trades with formatting, profit/loss calculation, and edit actions, including loading and empty states.",
  "frontend/src/components/mistakes/EditMistakeDialog.tsx": "Dialog for editing or deleting an existing mistake entry with mutation handlers and confirmation prompts.",
  "frontend/src/components/mistakes/MistakeEntryForm.tsx": "Form component for logging a new trading mistake with date, category, and description inputs using createMistake.",
  "frontend/src/components/mistakes/MistakeList.tsx": "Renders a list of mistake entries with category labels, AI suggestions, edit functionality, and loading/empty states.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Profile setup dialog that collects full name and username and submits them to create a new user profile.",
  "frontend/src/components/subscriptions/PaymentView.tsx": "UI for submitting a subscription payment with coupon handling, PDF upload validation, and payment submission via mutation.",
  "frontend/src/components/subscriptions/SubscriptionsView.tsx": "Displays current subscription status and available plans, allowing plan selection and routing to PaymentView.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Enhanced actor initializer with connection status tracking, health checks, and exponential auto-retry logic.",
  "frontend/src/hooks/useEntitlement.ts": "Derives feature access and plan metadata based on the caller’s subscription state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and initialization of stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on trades and mistakes using the backend actor with success/error handling and cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and DOM updates.",
  "frontend/src/index.css": "Defines Tailwind base styles and color variables for light/dark themes, plus utility and mobile dialog tweaks.",
  "frontend/src/lib/backendConnectionErrors.ts": "Classifies backend connection errors and returns user-friendly messages with diagnostics.",
  "frontend/src/lib/backendDiagnostics.ts": "Collects and formats backend environment diagnostics such as canister ID, host, and user agent.",
  "frontend/src/lib/branding.ts": "Exports app branding constants like name, tagline, and logo path.",
  "frontend/src/lib/domainSlug.ts": "Validates and generates sanitized domain slugs and exports the app's predefined slug.",
  "frontend/src/lib/pipValues.ts": "Stores pip values for common forex pairs and provides a lookup helper.",
  "frontend/src/lib/riskCalculator.ts": "Provides pip value lookup and a lot-size calculator with validation.",
  "frontend/src/lib/safeErrorMessage.ts": "Converts raw errors into safer, user-friendly messages with special handling for payments, permissions, and uploads.",
  "frontend/src/lib/trades.ts": "Contains helpers to calculate P/L and format trade-related currency values.",
  "frontend/src/lib/tradingPairs.ts": "Defines selectable trading pair options for general use and calculators, including custom and metal pairs.",
  "frontend/src/lib/userId.ts": "Formats and parses sequential numeric user IDs for display and input.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/tabs/AdminPanelTab.tsx": "Displays the admin panel or an access dialog based on permanent or unlocked admin authorization, handling related loading states.",
  "frontend/src/tabs/JournalTab.tsx": "Displays journal analytics, trade entry, trade list, and a calendar view with date-filtered trades.",
  "frontend/src/tabs/MistakesTab.tsx": "Fetches and displays user trading mistakes with an entry form and AI-suggestion notice.",
  "frontend/src/tabs/ProfileTab.tsx": "Loads and edits user profile data, handles admin checks, theme selection, and subscription view switching.",
  "frontend/src/tabs/RiskCalculatorTab.tsx": "Provides a risk management calculator for lot size based on account settings and pip values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-stored parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, animations, containers, and plugins.",
  "project_state.json": "Metadata describing project features, requirements, and current state for theme toggle implementation."
}