{
  "backend/main.mo": "Motoko backend actor defining user profiles, subscriptions, trades, mistakes, payments, admin auth, and QR code upload/clear functions with storage mixins and access control.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, tests, and confidence for recent frontend calculator and navigation changes.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing behavior of all major frontend components, tabs, and hooks.",
  "frontend/index.css": "Tailwind CSS base setup defining light/dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/index.html": "Main HTML template loading fonts, initializing theme early, loading env config for canister ID, and mounting the Vite React app.",
  "frontend/public/domain-slug.txt": "Stores the app's domain slug identifier.",
  "frontend/public/env.json": "Holds a placeholder backend canister ID for runtime configuration.",
  "frontend/src/App.tsx": "Main React app managing authentication, backend connection state, error handling UI, tab navigation, and rendering core tabs including the Lot Size calculator.",
  "frontend/src/components/admin/AdminAccessDialog.tsx": "Password prompt dialog that verifies admin access using a mutation and handles success or error states.",
  "frontend/src/components/admin/AdminDiscountsDialog.tsx": "Interface for creating, editing, enabling/disabling, and deleting discount codes with timestamp conversion and form handling.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin dashboard providing navigation to user management, payments, methods, discounts, QR codes, and password rotation dialogs.",
  "frontend/src/components/admin/AdminPaymentMethodsDialog.tsx": "Manages creation, editing, enabling/disabling, and deletion of payment methods with basic form state.",
  "frontend/src/components/admin/AdminPaymentQRCodeDialog.tsx": "Dialog for uploading, previewing, clearing, and validating payment QR code images with progress tracking.",
  "frontend/src/components/admin/AdminPaymentsDialog.tsx": "Displays pending user payments and allows admins to view proofs, approve, or reject submissions with optional reasons.",
  "frontend/src/components/admin/AdminRotatePasswordDialog.tsx": "Dialog for permanent admins to rotate the admin password with validation, permission checks, and success/error handling.",
  "frontend/src/components/admin/AdminUserDetailDialog.tsx": "Admin dialog showing a user's profile, trades, subscription status, and actions to activate, cancel, or remove the user.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and automatic session clearing.",
  "frontend/src/components/journal/EditTradeDialog.tsx": "Dialog to edit or delete a trade entry, allowing updates to date, session, pair, risk values, and outcome.",
  "frontend/src/components/journal/JournalAnalyticsHeader.tsx": "Displays summary analytics for trades including totals, accuracy, and P/L with loading skeletons.",
  "frontend/src/components/journal/ProfitCalendar.tsx": "Monthly calendar showing daily net P/L and trade counts with month navigation and date selection.",
  "frontend/src/components/journal/TradeEntryForm.tsx": "Form component for creating new trade entries, handling state, validation, and submission to the backend.",
  "frontend/src/components/journal/TradeList.tsx": "Displays a table of recorded trades with P/L calculations, loading states, and optional edit actions.",
  "frontend/src/components/layout/ViewContainer.tsx": "Simple wrapper component that applies layout styling and renders child content.",
  "frontend/src/components/mistakes/EditMistakeDialog.tsx": "Dialog for editing or deleting a mistake entry, including form handling and confirmation prompts.",
  "frontend/src/components/mistakes/MistakeEntryForm.tsx": "Form for creating a new mistake entry with date, category, and description fields.",
  "frontend/src/components/mistakes/MistakeList.tsx": "Displays a list of logged mistakes with category labels, dates, AI suggestions, and edit options.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar rendering tabs with icons and handling tab switching.",
  "frontend/src/components/navigation/TabScene.tsx": "Wrapper that mounts only the active tab's content to prevent overlapping UI.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A dialog that collects full name and username to create a user profile and start a free trial, using form inputs and a mutation hook.",
  "frontend/src/components/subscriptions/PaymentView.tsx": "Handles payment submission for a selected plan, including uploading a PDF proof, entering transaction details, and showing confirmation after submission.",
  "frontend/src/components/subscriptions/SubscriptionsView.tsx": "Displays subscription status, trial info, available plans, and routes to the payment view when a plan is selected.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Manages backend actor initialization with retries, health checks, and detailed status tracking for connection readiness or errors.",
  "frontend/src/hooks/useEntitlement.ts": "Derives feature access and plan status (trial, expired, paid tiers) from the caller's subscription state and exposes loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading identities, login, logout, and tracking status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for initializing user access and performing CRUD operations on trades, mistakes, and related backend data using an actor API.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and applies theme classes to the document root.",
  "frontend/src/index.css": "Global Tailwind-based stylesheet defining light/dark themes, layout rules, safe-area handling, and UI utility classes.",
  "frontend/src/lib/backendConnectionErrors.ts": "Classifies backend errors such as authorization, stopped canister, and misconfiguration, returning structured user-friendly messages.",
  "frontend/src/lib/backendDiagnostics.ts": "Gathers diagnostics about backend canister configuration, environment, and deployment type, detecting placeholder or missing IDs.",
  "frontend/src/lib/branding.ts": "Exports branding constants including app name, tagline, and logo path.",
  "frontend/src/lib/domainSlug.ts": "Validates and generates deployment-safe domain slugs and exports the app's predefined slug.",
  "frontend/src/lib/pipValues.ts": "Provides pip value mappings for trading pairs and a helper to retrieve pip values with exclusions.",
  "frontend/src/lib/riskCalculator.ts": "Contains helpers for retrieving pip values and calculating lot size based on risk, stop-loss, and pip value.",
  "frontend/src/lib/safeErrorMessage.ts": "Maps various backend error messages to user-friendly strings with specific cases for payments, admin access, subscriptions, profiles, trades, and network issues.",
  "frontend/src/lib/trades.ts": "Provides helpers to calculate trade profit/loss and format currency and signed values.",
  "frontend/src/lib/tradingPairs.ts": "Defines trading pair options and an extended list for calculators with custom pair support.",
  "frontend/src/lib/userId.ts": "Formats numeric user IDs into padded display strings and parses them back to numbers.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/tabs/AdminPanelTab.tsx": "Handles admin access checks and renders either the admin panel, access dialog, or loading/error states.",
  "frontend/src/tabs/JournalTab.tsx": "Displays trade analytics, entry form, and list/calendar views with date filtering and error handling.",
  "frontend/src/tabs/MistakesTab.tsx": "Renders mistake logging tools with AI suggestion info and lists user-submitted mistakes.",
  "frontend/src/tabs/ProfileTab.tsx": "Shows user profile details, subscription status, and handles loading, errors, and subscription view toggling.",
  "frontend/src/tabs/RiskCalculatorTab.tsx": "Implements a risk calculator with form validation, pip value handling, and position size computation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, dark mode, and plugin setup for the frontend.",
  "project_state.json": "Stores project metadata, features, and state tracking for tasks related to updating the calculator to an account lot size calculator."
}