{
  "backend/main.mo": "Motoko backend actor defining user profiles, trades, mistakes, subscriptions, payments, admin auth, and QR code upload with authorization mixins and stable state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "Plain-text summaries of numerous frontend files describing each component’s purpose and behavior.",
  "frontend/index.css": "Tailwind base/theme configuration defining gold–charcoal color variables for light/dark modes and global styles.",
  "frontend/index.html": "HTML entry point loading theme settings, runtime env loader, Google Fonts, and bootstrapping the React app.",
  "frontend/public/domain-slug.txt": "Contains the deployment domain slug for the frontend.",
  "frontend/public/env.json": "Holds the backend canister ID used for runtime configuration.",
  "frontend/src/App.tsx": "Main React app component handling authentication, backend connection state, tab navigation, errors, and UI layout.",
  "frontend/src/components/admin/AdminAccessDialog.tsx": "Provides a password prompt dialog for unlocking admin access with validation and error handling.",
  "frontend/src/components/admin/AdminDiscountsDialog.tsx": "Manages creation, editing, toggling, and deletion of discount codes using admin query hooks.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin dashboard displaying user management, payments, discounts, QR code tools, and navigation between views.",
  "frontend/src/components/admin/AdminPaymentMethodsDialog.tsx": "Handles creation, editing, enabling/disabling, and deletion of payment methods through admin APIs.",
  "frontend/src/components/admin/AdminPaymentQRCodeDialog.tsx": "Allows uploading, previewing, clearing, and validating a payment QR code with progress tracking.",
  "frontend/src/components/admin/AdminPaymentsDialog.tsx": "Displays pending payments and enables admins to approve, reject, or view submitted payment proofs.",
  "frontend/src/components/admin/AdminRotatePasswordDialog.tsx": "Dialog for permanent admins to rotate the admin password with validation, success/error handling, and permission checks.",
  "frontend/src/components/admin/AdminUserDetailDialog.tsx": "Admin dialog showing detailed user info, subscription status, and actions to activate, cancel, or remove user accounts.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with status display and error recovery.",
  "frontend/src/components/journal/EditTradeDialog.tsx": "Dialog to edit or delete a trade entry, updating fields and confirming deletions via mutation hooks.",
  "frontend/src/components/journal/JournalAnalyticsHeader.tsx": "Displays key journal analytics such as total trades, accuracy, and total P/L with loading skeletons.",
  "frontend/src/components/journal/ProfitCalendar.tsx": "Calendar view summarizing daily net P/L and trade counts with month navigation and date selection.",
  "frontend/src/components/journal/TradeEntryForm.tsx": "Form component for creating new trade entries, handling input state, validation, and submission to the backend.",
  "frontend/src/components/journal/TradeList.tsx": "Displays a table of recorded trades with formatting, P/L calculation, and optional edit actions.",
  "frontend/src/components/mistakes/EditMistakeDialog.tsx": "Dialog for editing or deleting a mistake entry with form handling and confirmation UI.",
  "frontend/src/components/mistakes/MistakeEntryForm.tsx": "Form for logging new trading mistakes including category, date, and description submission.",
  "frontend/src/components/mistakes/MistakeList.tsx": "Lists mistake entries with category labels, descriptions, AI suggestions, and edit capability.",
  "frontend/src/components/navigation/BottomNav.tsx": "Bottom navigation bar rendering tabs with icons and active state handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A dialog collecting full name and username to create a user profile and start a 2‑day trial, with form validation and loading states.",
  "frontend/src/components/subscriptions/PaymentView.tsx": "Handles subscription payment submission including QR code display, PDF upload validation, transaction details, and success confirmation.",
  "frontend/src/components/subscriptions/SubscriptionsView.tsx": "Displays subscription state, trial status, and available plans, routing users to payment when a plan is selected.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Manages backend actor initialization with detailed connection status, retries, timeouts, and health checks.",
  "frontend/src/hooks/useEntitlement.ts": "Determines feature access based on the user's subscription or trial state, returning entitlement flags and loading status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, including loading, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for initializing user access and performing CRUD operations on trades and mistakes via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Custom hook to manage light/dark theme with localStorage persistence and document class updates.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, layout utilities, and UI layering fixes.",
  "frontend/src/lib/backendConnectionErrors.ts": "Classifies backend errors into user-friendly categories such as misconfiguration, authorization, and stopped canisters with retry guidance.",
  "frontend/src/lib/backendDiagnostics.ts": "Collects diagnostic data about backend canister IDs, environment, and deployment type to detect configuration issues.",
  "frontend/src/lib/branding.ts": "Defines static branding constants including app name, tagline, and logo path.",
  "frontend/src/lib/domainSlug.ts": "Validates and generates domain slugs following character and length rules, including a predefined app slug.",
  "frontend/src/lib/pipValues.ts": "Stores pip values for major forex pairs and exposes a helper to retrieve them or null for unsupported pairs.",
  "frontend/src/lib/riskCalculator.ts": "Provides pip value lookup and a lot-size calculator with validation for risk, stop loss, and pip value.",
  "frontend/src/lib/safeErrorMessage.ts": "Maps various backend error strings to user-friendly messages, handling payment, admin, subscription, profile, trade, and network errors.",
  "frontend/src/lib/trades.ts": "Provides helper functions to calculate trade P/L and format currency or signed amounts.",
  "frontend/src/lib/tradingPairs.ts": "Defines trading pair option types and exports lists of standard and calculator-specific trading pairs.",
  "frontend/src/lib/userId.ts": "Formats and parses sequential user IDs in the #000001 display format.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/tabs/AdminPanelTab.tsx": "Checks admin status and displays the AdminPanel or an unlock dialog based on authorization state.",
  "frontend/src/tabs/JournalTab.tsx": "Displays trade analytics, entry form, list, and a calendar view with date-based trade filtering.",
  "frontend/src/tabs/MistakesTab.tsx": "Shows an AI‑learning prompt and renders forms and lists for logging trading mistakes.",
  "frontend/src/tabs/ProfileTab.tsx": "Displays the user's profile details, identity info, and appearance settings if available.",
  "frontend/src/tabs/RiskCalculatorTab.tsx": "Implements a risk calculator UI that computes lot size based on account settings, risk mode, pip value, and SL distance.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugins for the frontend UI.",
  "project_state.json": "Tracks project rebuild status, known issues, feature requirements, and requested UI/logo updates."
}