{
  "backend/main.mo": "Defines backend actor with user profiles, trades, mistakes, subscriptions, and helpers for access control and subscription status.",
  "backend/migration.mo": "Stub migration module exposing a no‑op run function.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Defines global Tailwind CSS variables and dark mode theme tokens using OKLCH values.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app with favicon and title metadata.",
  "frontend/public/domain-slug.txt": "Defines the deployment domain slug for the frontend app.",
  "frontend/src/App.tsx": "Main React app handling authentication, entitlement-based tab visibility, error states, and initial profile setup flow.",
  "frontend/src/components/admin/AdminAccessDialog.tsx": "Empty placeholder file for admin access dialog component.",
  "frontend/src/components/admin/AdminDiscountsDialog.tsx": "Admin dialog for listing, creating, editing, and deleting discount objects with timestamp handling and form state.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin dashboard that loads all user data, filters users by ID, and opens dialogs for user details, payment methods, and discounts.",
  "frontend/src/components/admin/AdminPaymentMethodsDialog.tsx": "Dialog for viewing, creating, editing, and deleting payment methods with form handling and mutation hooks.",
  "frontend/src/components/admin/AdminUserDetailDialog.tsx": "Dialog displaying user profile, trades, mistakes, and subscription info with actions to activate, cancel, or remove a user.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with loading states and error handling.",
  "frontend/src/components/journal/EditTradeDialog.tsx": "Dialog for editing or deleting a trade entry with form fields mapped to trade properties and update/delete mutations.",
  "frontend/src/components/journal/JournalAnalyticsHeader.tsx": "Header component showing analytics stats such as total trades, accuracy, and P/L with loading skeletons.",
  "frontend/src/components/journal/ProfitCalendar.tsx": "Renders a monthly calendar showing aggregated daily net P/L and trade counts, allowing month navigation and date selection.",
  "frontend/src/components/journal/TradeEntryForm.tsx": "Provides a form to create new trade entries, handling date, session, pair, risk values, and submission state.",
  "frontend/src/components/journal/TradeList.tsx": "Displays a table of recorded trades with formatted data, P/L calculation, and optional editing actions.",
  "frontend/src/components/mistakes/EditMistakeDialog.tsx": "Modal dialog for editing or deleting a mistake entry with form validation and confirmation handling.",
  "frontend/src/components/mistakes/MistakeEntryForm.tsx": "Form for logging a new trading mistake including date, category, and description, with submission handling.",
  "frontend/src/components/mistakes/MistakeList.tsx": "Lists logged mistakes with category, date, description, AI suggestion, and supports editing via a dialog.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A dialog component that collects full name and username to create a user profile and start a free trial.",
  "frontend/src/components/subscriptions/PaymentView.tsx": "Displays payment details for a selected plan with QR code instructions and support contact info.",
  "frontend/src/components/subscriptions/SubscriptionsView.tsx": "Manages subscription state, displays available plans, handles plan selection, and routes to payment view.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Enhanced actor initialization hook providing connection status, retries, and access control setup handling.",
  "frontend/src/hooks/useEntitlement.ts": "Derives feature access and plan status based on the caller's subscription or trial state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login handling, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, trades, mistakes, subscriptions, and admin checks, wrapping backend actor calls with loading and error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for theming, applying global styles and typography.",
  "frontend/src/lib/backendConnectionErrors.ts": "Classifies backend connection errors into user-friendly categories, detecting stopped canisters, timeouts, and initialization issues.",
  "frontend/src/lib/branding.ts": "Exports constants for the app's name, tagline, and logo path.",
  "frontend/src/lib/domainSlug.ts": "Validates and generates sanitized domain slugs and exports the app’s predefined slug.",
  "frontend/src/lib/pipValues.ts": "Stores pip values for common forex pairs and exposes a helper to retrieve pip values or null for unsupported pairs.",
  "frontend/src/lib/riskCalculator.ts": "Calculates pip values and trade lot sizes with validation for risk, stop loss, and pip value inputs.",
  "frontend/src/lib/trades.ts": "Provides helpers to compute trade P/L and format currency and signed P/L amounts.",
  "frontend/src/lib/tradingPairs.ts": "Defines selectable trading pair options for forms and calculators, including major pairs and custom options.",
  "frontend/src/lib/userId.ts": "Formats and parses sequential user IDs into readable strings and back.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query, Internet Identity, and global styles.",
  "frontend/src/tabs/JournalTab.tsx": "Displays trades, analytics, and a calendar view, allowing trade entry and date-based filtering.",
  "frontend/src/tabs/MistakesTab.tsx": "Shows AI‑assisted mistake logging with a form and list of recorded mistakes.",
  "frontend/src/tabs/ProfileTab.tsx": "Manages user profile viewing/editing, admin access, and subscription management with conditional rendering.",
  "frontend/src/tabs/RiskCalculatorTab.tsx": "React component providing a risk management calculator that computes lot size based on account type, account size, risk mode, stop-loss pips, and trading pair pip values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, writing, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "JSON document describing current project state, admin-panel requirements, existing features, and pending feature requests tied to admin access and authorization."
}