{
  "kind": "build_request",
  "title": "Rebuild app; fix overlapping option menus; refresh UI and update logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rebuild the application and ensure it deploys successfully (no build/runtime errors) after the previous draft expiry/generation failure.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Pls build it again",
          "Your draft app has expired. Do you want to rebuild it?"
        ]
      },
      "acceptanceCriteria": [
        "`dfx deploy` (or the platform build) completes successfully for both frontend and backend.",
        "The app loads to the main shell without a blank screen or fatal console errors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the UI overlap/visibility issue when opening options/menus so that popovers, dropdowns, and other option panels are always fully visible and not covered by fixed UI (e.g., bottom navigation) on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "In this when I open any other option it not clearly visible it's over lapping"
        ]
      },
      "acceptanceCriteria": [
        "Opening any options menu (e.g., dropdowns/popovers within tabs and dialogs) renders above fixed elements and remains readable.",
        "Menus are not clipped by parent containers (no hidden content due to `overflow: hidden` on ancestors).",
        "On small screens, option panels reposition or scroll as needed so all actions are accessible without overlap."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the app UI with a cohesive refreshed visual theme (colors, typography, spacing, surfaces) and apply it consistently across the header, tabs, forms, tables, dialogs, and admin screens. Use a distinct gold/charcoal theme inspired by the provided logo screenshot (avoid default blue/purple styling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "And also change ui and logo"
        ]
      },
      "acceptanceCriteria": [
        "Primary/secondary colors, background, borders, and typography are updated consistently across all tabs (Journal, Calculator, Mistakes, Profile, Admin).",
        "Updated theme preserves accessibility (text contrast remains readable in light and dark mode if supported).",
        "No new UI regressions: layouts remain responsive, and key screens (forms, lists, dialogs) remain usable on mobile widths."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Replace/update the application logo using the uploaded image as the visual reference. Update the app branding so the header and loading/connecting states display the new logo asset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "And also change ui and logo"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image is added under `frontend/public/assets/generated/` and referenced by `frontend/src/lib/branding.ts` (`LOGO_PATH`).",
        "Header logo and all existing logo placements (e.g., connecting/initializing/error screens in `frontend/src/App.tsx`) render the new asset without stretching or pixelation.",
        "Logo loads correctly in production build (no 404)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add the newly generated logo image(s) as static assets in `frontend/public/assets/generated` and ensure the UI references them directly (do not proxy images through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "change ui and logo"
        ]
      },
      "acceptanceCriteria": [
        "Generated image files exist at `frontend/public/assets/generated/*` with the specified filenames.",
        "`LOGO_PATH` points to a file within `/assets/generated/` and renders correctly at runtime."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not edit immutable hook entrypoints: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features beyond fixing overlap issues and updating UI/logo (e.g., new tabs, new subscription plans, new payment providers).",
    "Integrating third-party authentication providers (only Internet Identity is allowed).",
    "Adding external databases or non-Internet-Computer backend services."
  ],
  "imageRequirements": {
    "required": [
      "Square app logo based on the uploaded gold/black trading mark and text (app-logo-yug-v2.dim_1024x1024.png)",
      "Square app icon variant derived from the same mark, simplified for small sizes (app-icon-yug-v2.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}