{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Risk/lot size calculator: funded vs own-capital flows + stop-loss pips + in-page validation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an initial account-mode selector (Funded vs Own Capital) and conditionally render/reset calculator inputs by mode.",
      "acceptanceCriteria": [
        "Risk calculator shows an initial selector with two options: “Funded Account” and “Own Capital”.",
        "Changing the selection resets/hides inputs that are not applicable to the selected mode.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Introduce an initial 'Account Mode' selection (Funded Account vs Own Capital) and render the rest of the form only after a mode is chosen; when mode changes, clear mode-specific fields (account size preset/other) and also clear calculation result + any in-page messages to avoid stale state."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement funded-account account-size presets with an Other option that reveals a custom USD input and is used in calculation/validation context.",
      "acceptanceCriteria": [
        "When “Funded Account” is selected, the form includes an “Account Size (USD)” control with the specified presets and an “Other” option.",
        "Selecting “Other” reveals a numeric input to enter a custom funded account size in USD.",
        "The funded account size used for calculation/validation equals the selected preset amount or the custom “Other” amount."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "When mode is Funded Account, add an 'Account Size (USD)' selector with presets 1k, 2k, 5k, 10k, 25k, 50k, 100k, 200k and an 'Other' option; if 'Other' is selected, reveal a numeric input for the custom size and derive a single fundedAccountSizeUSD value from preset vs other (used for warning/validation context)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement own-capital account-size presets ($50/$100) with an Other option that reveals a custom USD input and is used in calculation/validation context.",
      "acceptanceCriteria": [
        "When “Own Capital” is selected, the form includes an “Account Size (USD)” control with presets $50 and $100 and an “Other” option.",
        "Selecting “Other” reveals a numeric input to enter a custom own-capital size in USD.",
        "The own-capital size used for calculation/validation equals the selected preset amount or the custom “Other” amount."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "When mode is Own Capital, add an 'Account Size (USD)' selector with presets 50 and 100 and an 'Other' option; if 'Other' is selected, reveal a numeric input for the custom size and derive a single ownCapitalSizeUSD value from preset vs other (used for warning/validation context)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Switch stop-loss input to direct pips entry, remove entry/price-based pips conversion, and reflect pips in results.",
      "acceptanceCriteria": [
        "The form includes a “Stop Loss (pips)” numeric input.",
        "The previous entry/price-based stop-loss-to-pips calculation is removed from the UI flow and replaced by using the user-entered pips value directly.",
        "Result section displays “Stop Loss (pips)” using the entered pips value."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Remove the Entry Price and price-based Stop Loss inputs and replace them with a single numeric 'Stop Loss (pips)' input; update calculation + result rendering to use/display the user-entered pips directly."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add Risk Amount (USD) input and compute lot size from riskUSD, stop-loss pips, and pip value per lot (adjusted), with clear validation and updated outputs.",
      "acceptanceCriteria": [
        "The form includes a required “Risk Amount (USD)” numeric input.",
        "On Calculate, the app computes lot size using the entered risk amount, entered stop-loss pips, and the pip value for the selected pair (or custom pip value when required).",
        "If required inputs are missing/invalid (risk <= 0, stop loss pips <= 0, missing pair, missing custom pip value when required), the user sees a clear English error message and no result is shown.",
        "The displayed “Position Size” output updates to reflect the new inputs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Add a required numeric 'Risk Amount (USD)' input (shown in both modes) and update the Calculate handler to: validate required inputs, resolve pip value (built-in vs custom), apply any existing pip-value-per-lot adjustment logic if still desired, call the existing calculateLotSize utility using lotSize = riskUSD / (slPips * pipValuePerLotAdjusted), and update the result section to show the new Position Size along with risk amount, stop-loss pips, and pip value used."
        },
        {
          "path": "frontend/src/lib/riskCalculator.ts",
          "operation": "modify",
          "description": "Keep/align the calculator utility so it cleanly supports the new formula and validations (riskUSD > 0, slPips > 0, pipValuePerLot > 0) and returns an English error message when invalid; reuse existing pip-value lookup behavior."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Preserve trading-pair selection and custom pip value requirement for XAUUSD/XAGUSD/OTHER in both funded and own-capital flows.",
      "acceptanceCriteria": [
        "Trading pair select remains available in both flows.",
        "If the selected pair is XAUUSD, XAGUSD, or OTHER, a “Custom Pip Value (USD)” input is required before calculation.",
        "If the selected pair is not one of those, the calculator uses the built-in pip value lookup."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Keep the Trading Pair selector available regardless of mode and maintain the current behavior: when pair is XAUUSD, XAGUSD, or OTHER, show a 'Custom Pip Value (USD)' input and require it for calculation; otherwise use the existing pip-value lookup."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Replace window.alert validation with in-page error feedback in the risk calculator view.",
      "acceptanceCriteria": [
        "No validation failures use `window.alert` in the Risk Calculator.",
        "Validation errors appear inside the calculator view in English, and are cleared/updated appropriately when the user edits inputs or recalculates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Remove all alert(...) calls and implement in-page validation feedback: store an error message in component state, render it inside the calculator UI using the existing Alert component area, clear errors when relevant inputs change and/or when recalculating, and ensure no result is shown when a blocking validation error is present."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Show a non-blocking warning when risk amount exceeds selected account size while still allowing calculation.",
      "acceptanceCriteria": [
        "If risk amount > account size, the UI shows a visible warning message in the calculator.",
        "Calculation still completes and shows a lot size result despite the warning."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Derive a single selectedAccountSizeUSD from the active mode's account-size control, and when riskUSD > selectedAccountSizeUSD show a visible in-page warning (distinct from blocking errors) while still performing the lot-size calculation and showing results."
        }
      ]
    }
  ]
}