{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Convert Calculator tab to Account Lot Size Calculator (match older version)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the calculator tab UI copy/structure to present as an Account Lot Size Calculator while keeping existing inputs and calculation behavior.",
      "acceptanceCriteria": [
        "When viewing the Calculator tab, the header title reads \"Lot Size Calculator\" (or \"Account Lot Size Calculator\") and no longer says \"Risk Calculator\".",
        "The primary action button text uses lot-size wording (e.g., \"Calculate Lot Size\") and results wording refers to \"Lot Size\" / \"Position Size\" consistently.",
        "All user-facing text introduced/changed by this update is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Update the calculator view’s English UI copy and layout to match an \"Account Lot Size Calculator\" presentation (header title/description, section titles/descriptions, button text, and result labels) while keeping the same inputs and calculation behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace native browser alerts with inline validation UI in the lot size calculator.",
      "acceptanceCriteria": [
        "Submitting with missing required fields does not open a browser alert dialog.",
        "Validation messages are shown in the calculator view and clearly indicate what must be fixed (e.g., missing balance, missing pair, missing custom pip value for XAUUSD/XAGUSD/OTHER, invalid stop loss pips).",
        "Once inputs are corrected, validation messages clear and calculation can proceed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Remove all alert(...) validation and implement inline validation state. Use existing shadcn-ui components (e.g., Alert) to display a form-level validation summary and/or per-field helper/error text within the page; ensure errors clear as the user fixes inputs and that calculation only runs when valid. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Deduplicate pip value logic by making riskCalculator.ts delegate to the shared pipValues utility.",
      "acceptanceCriteria": [
        "There is a single source of truth for the default pip values (the table in `frontend/src/lib/pipValues.ts`).",
        "`frontend/src/lib/riskCalculator.ts` no longer defines its own pip values table and instead delegates to the shared pip-value helper.",
        "The calculator continues to return the same lot-size results for the same inputs as before the refactor."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/riskCalculator.ts",
          "operation": "modify",
          "description": "Remove the local hardcoded pip values table and update getPipValue (or its equivalent) to delegate to the shared helper in frontend/src/lib/pipValues.ts, preserving current null/\"custom required\" behavior for XAUUSD/XAGUSD/OTHER and keeping lot-size calculation results unchanged."
        },
        {
          "path": "frontend/src/tabs/RiskCalculatorTab.tsx",
          "operation": "modify",
          "description": "Update imports/usages as needed so the calculator continues to obtain pip values via the refactored shared pip-value logic (no duplicated pip tables), without changing existing calculation behavior."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Rename the bottom navigation label for the calculator tab to \"Lot Size\" while keeping tab id/routing unchanged.",
      "acceptanceCriteria": [
        "The bottom nav shows the calculator tab label as \"Lot Size\" (or \"Lot Size Calc\") instead of \"Calculator\".",
        "Tapping the tab still switches to the same calculator tab content (no new tab id is introduced)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Change the label for the existing tab with id `calculator` from \"Calculator\" to \"Lot Size\" (or equivalent) while leaving the tab id and navigation structure unchanged."
        }
      ]
    }
  ]
}