{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend rollback alignment and restore-build stabilization for Version 35",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Revert the frontend UI/behavior to match the previously working Version 35 experience (remove Version 38+ UI changes).",
      "acceptanceCriteria": [
        "After deployment, the running app reflects the same functionality and UI as Version 35 (no Version 38+ changes remain).",
        "No build-time or deploy-time errors occur during the restore attempt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Rollback Version 38+ UI/behavior changes in the main app shell (connection/initialization states, tab visibility/ordering, header/footer content) to match the Version 35 UX. Ensure any removed functionality is not referenced anywhere to avoid runtime errors."
        },
        {
          "path": "frontend/src/lib/branding.ts",
          "operation": "modify",
          "description": "Restore Version 35 branding constants (name/tagline/logo path) so the header/logo render matches Version 35. If using a generated asset, point to the exact static file path under frontend/public/assets/generated/. Ensure the chosen values match Version 35."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Restore Version 35 head metadata and icons (favicon/apple-touch-icon/title/description) to match Version 35. Ensure any icon references resolve to existing assets and match Version 35."
        },
        {
          "path": "frontend/src/components/navigation/BottomNav.tsx",
          "operation": "modify",
          "description": "Adjust navigation/tab rendering (labels/icons/active behavior) to match Version 35 navigation behavior and ensure it stays wired to the tabs used in frontend/src/App.tsx."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix frontend restore/build failures so a Version 35 restore can compile and deploy successfully, with clear actionable configuration errors when prerequisites are missing.",
      "acceptanceCriteria": [
        "Triggering a restore to Version 35 completes successfully end-to-end (build + deploy).",
        "If any restore preconditions are required, the system surfaces a clear, actionable error message explaining what is missing instead of a generic implementation failure."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorWithStatus.ts",
          "operation": "modify",
          "description": "Remove or safely guard any calls that can break a Version 35 restore build (e.g., invoking backend functions not present/typed in the current frontend interface). Ensure actor initialization/health check still works and failures are converted into actionable errors rather than unhandled implementation errors."
        },
        {
          "path": "frontend/src/lib/backendConnectionErrors.ts",
          "operation": "modify",
          "description": "Ensure restore preconditions (especially missing/placeholder BACKEND_CANISTER_ID) produce a clear, actionable message suitable for deploy diagnostics (what is missing, where it should come from, and what to do next), and that these errors do not trigger infinite/pointless retries."
        },
        {
          "path": "frontend/src/lib/backendDiagnostics.ts",
          "operation": "modify",
          "description": "Harden canister-id discovery so Version 35 restores reliably detect configuration issues and report the canister ID source consistently across local/IC/Caffeine deployments."
        },
        {
          "path": "frontend/public/env.json",
          "operation": "modify",
          "description": "Keep env.json compatible with Version 35 restore assumptions (runtime canister ID injection). Ensure placeholder behavior is supported and produces the actionable error messaging in-app (not a generic implementation failure)."
        }
      ]
    }
  ]
}