{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Light/Dark theme toggle in Profile with client persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an Appearance section in the Profile tab to let users switch between Light and Dark themes.",
      "acceptanceCriteria": [
        "Profile tab contains an \"Appearance\" (or equivalent) section with controls to select Light or Dark theme.",
        "Switching the setting immediately updates the UI colors (background/foreground/cards) using the existing Tailwind/CSS variable theme setup.",
        "All user-facing labels for this section are in English (e.g., \"Appearance\", \"Theme\", \"Light\", \"Dark\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/ProfileTab.tsx",
          "operation": "modify",
          "description": "Add an \"Appearance\" section (within existing Profile layout) with Light/Dark selection controls wired to a shared theme state setter. Use existing shadcn/ui composed components (e.g., Card, Button, Label/Input patterns) to match current UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "create",
          "description": "Create a small theme hook that exposes the current theme and a setter (e.g., 'light' | 'dark') so Profile can update theme consistently across the app, applying changes by toggling the document root class to integrate with the existing Tailwind 'dark' + CSS variables setup."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist the selected theme in browser storage and restore/apply it on app load.",
      "acceptanceCriteria": [
        "Theme selection is saved in browser storage (e.g., localStorage).",
        "On page load, the app reads the stored theme and applies it before/when rendering so the chosen theme is consistently applied.",
        "If no stored preference exists, default behavior is clearly defined and consistent (e.g., keep current default dark, but still user-changeable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "modify",
          "description": "Implement localStorage persistence for theme selection (read initial value, write on change) and define a consistent default when no preference exists (keep current default behavior as dark unless otherwise detected/decided)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a small early-load script in the document head to read the saved theme from localStorage and apply/remove the 'dark' class on the <html> element before React renders, to prevent theme flash and ensure the stored preference takes effect immediately."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove unconditional runtime dark-mode enforcement and ensure document color-scheme follows the selected theme.",
      "acceptanceCriteria": [
        "The app no longer unconditionally forces the `dark` class on `document.documentElement` at runtime.",
        "When switching themes, `document.documentElement` has the `dark` class only when Dark theme is selected (and removed when Light is selected).",
        "The document `color-scheme` style is updated to match the selected theme (\"dark\" for dark theme, \"light\" for light theme)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the current effect that unconditionally adds the 'dark' class and sets colorScheme to dark; instead, rely on the centralized theme hook to apply the class based on user selection."
        },
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "modify",
          "description": "Ensure the theme application logic updates both (1) presence/absence of the 'dark' class on document.documentElement and (2) document.documentElement.style.colorScheme to 'dark' or 'light' in sync with the selected theme."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove the hardcoded default 'dark' class from the <html> tag (if present) so the selected theme (or defined default) is applied via the early theme bootstrap script and not overridden by static markup."
        }
      ]
    }
  ]
}